app/controllers/password_resets_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'z3ylnyLEyWAIZVbmWs4WQA' LIMIT 1
---
  def edit
    @user = User.find_by_password_reset_token!(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'z3ylnyLEyWAIZVbmWs4WQA' LIMIT 1
UPDATE `users` SET `password_digest` = '$2a$10$l64alonM7BwuqAEdUtXzA.yEK689jD.byep2PYGOgLpZCh0IaVhzu', `updated_at` = '2016-06-26 21:38:30' WHERE `users`.`id` = 2
---
  def update
    @user = User.find_by_password_reset_token!(params[:id])
    if @user.password_reset_sent_at < 2.hours.ago
      redirect_to new_password_reset_path, :alert => "Password reset has expired."
    elsif @user.update_attributes(params.permit![:user])