app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`email`, `first_name`, `second_name`, `password_digest`, `created_at`, `updated_at`, `auth_token`) VALUES ('rwv1001@yahoo.co.uk', 'Robert', 'Verrill', '$2a$10$Gp0kEhkD6SHnp5vp45h7Y.mi.fWtoCjzNZGIdHSYi/weFGr37yvJ2', '2016-06-26 21:50:04', '2016-06-26 21:50:04', '9giSzLH8Dw7SoC6akCSo4Q')